In [1]:
import pandas as pd

In [3]:
Data = pd.read_excel (r'C:\Users\vrssv\Desktop\Data Analyst\19. Kaggle, Date & Time Split (Nov 18)\TASK\TASK -- convert raw data - clean data.xlsx')

In [5]:
Data

                                          ADDR         DT     NAME     time
0  45 rd, kenith street, btm, bangalore 500038 2022-04-03  Lavanya  8:30:21
1            45 rd,  street, hitech, Hd 500038 2022-04-02    Ramya  5:30:21

In [7]:
Data.iloc[0,0] = ('43rd, Kenith Street, BTM, Bangalore, 500038')
Data.iloc[1,0] = ('45th, Street, Hi-Tech, Hyderabad, 500040')

In [9]:
Data

                                          ADDR         DT     NAME     time
0  43rd, Kenith Street, BTM, Bangalore, 500038 2022-04-03  Lavanya  8:30:21
1     45th, Street, Hi-Tech, Hyderabad, 500040 2022-04-02    Ramya  5:30:21

In [11]:
Data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2 entries, 0 to 1
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   ADDR    2 non-null      object
 1   DT      2 non-null      datetime64[ns]
 2   NAME    2 non-null      object
 3   time    2 non-null      object
dtypes: datetime64[ns](1), object(3)
memory usage: 196.0+ bytes

In [13]:
Data[['ROAD','STREET','AREA','CITY','ZIP']] = Data['ADDR'].str.split(',', expand = True)

In [15]:
Data

,ADDR,DT,NAME,time,ROAD,STREET,AREA,CITY,ZIP
0,"43rd, Kenith Street, BTM, Bangalore, 500038",2022-04-03,Lavanya,8:30:21,43rd,Kenith Street,BTM,Bangalore,500038
1,"45th, Street, Hi-Tech, Hyderabad, 500040",2022-04-02,Ramya,5:30:21,45th,Street,Hi-Tech,Hyderabad,500040

In [17]:
Data['Day'] = Data['DT'].dt.day
Data['Month'] = Data['DT'].dt.month
Data['Year'] = Data['DT'].dt.year

In [19]:
Data[['Hours','Minutes','Seconds']] = Data['time'].str.split(':', expand = True)

In [21]:
Data

,ADDR,DT,NAME,time,ROAD,STREET,AREA,CITY,ZIP,Day,Month,Year,Hours,Minutes,Seconds
0,"43rd, Kenith Street, BTM, Bangalore, 500038",2022-04-03,Lavanya,8:30:21,43rd,Kenith Street,BTM,Bangalore,500038,3,4,2022,8,30,21
1,"45th, Street, Hi-Tech, Hyderabad, 500040",2022-04-02,Ramya,5:30:21,45th,Street,Hi-Tech,Hyderabad,500040,2,4,2022,5,30,21

In [27]:
Data.drop(['ADDR','DT','time'], axis = 1, inplace = True)

In [29]:
Clean_Data = Data

In [31]:
Clean_Data

,NAME,ROAD,STREET,AREA,CITY,ZIP,Day,Month,Year,Hours,Minutes,Seconds
0,Lavanya,43rd,Kenith Street,BTM,Bangalore,500038,3,4,2022,8,30,21
1,Ramya,45th,Street,Hi-Tech,Hyderabad,500040,2,4,2022,5,30,21

In [33]:
Data.to_excel(r'C:\Users\vrssv\Desktop\Data Analyst\19. Kaggle, Date & Time Split (Nov 18)\TASK\Clean_Data.xlsx', index = False)

In [35]:
Clean_Data

,NAME,ROAD,STREET,AREA,CITY,ZIP,Day,Month,Year,Hours,Minutes,Seconds
0,Lavanya,43rd,Kenith Street,BTM,Bangalore,500038,3,4,2022,8,30,21
1,Ramya,45th,Street,Hi-Tech,Hyderabad,500040,2,4,2022,5,30,21